Можно использовать in для того чтобы посчитать очки.
Выходит что сначала будет один список из 52 карт. 
Будет 26 раундов, если нет 2-х джокеров.

А что если игра это процесс присваивания элемнтам словаря ключей 1 ирок или 
2 игрок. А подсчет будет происходит с помощью функции сравнит суммы. 
Но откуда значениям элементов будет известно, что

1. Элементы колоды должны быть скаладываемые.
 А что такое элемент? Ведь складывается не сам элемент.
На данный момент складывается 
2. Туплеты посмотреть.

-Карты выбираются методом

-Для удаления вытащенных карт функция in может быть заменена на метод index() и 
рандом